# StairsAreUpdatedDueToLevelHeightChange Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsAreUpdatedDueToLevelHeightChange Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Stair component(s) in the multistory stair are updated due to the level height changes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsAreUpdatedDueToLevelHeightChange { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsAreUpdatedDueToLevelHeightChange As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsAreUpdatedDueToLevelHeightChange {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace